app/controllers/api/users_controller.rb

  def index
    if params[:filter] == "recent"
      limit_param = params[:limit].to_i
      limit = limit_param > 0 ? limit_param : 3
      @users = User.all.order(id: :desc).limit(limit).pluck(:id)
      render json: @users
    else
      @users = User.all
---
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 11]]