app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @user = User.with_attached_profile_picture.find(params[:id])