app/controllers/application_controller.rb

  def current_user
    return nil unless session[:session_token]
    User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "RU3Na4F0Ot168kRT_W3eTQ"], ["LIMIT", 1]]